docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.org
#+TITLE: Next-Generation Logic Programming: Beyond Prolog in a Propagator-First Architecture
#+AUTHOR: Prologos Research
#+DATE: 2026-03-16
#+OPTIONS: toc:3 num:t
#+PROPERTY: header-args :eval never

* Introduction

Prologos already has a relational sublanguage (~defr~, ~rel~, ~solve~, ~explain~)
backed by a persistent propagator network, bilattice-based well-founded semantics,
SLG-style tabling, ATMS-based assumption management, and narrowing. This document
explores how to extend this foundation beyond a Prolog port into a genuinely
next-generation logic programming system.

The key insight is that Prologos's propagator-first architecture is not merely an
implementation detail---it is a /design space multiplier/. Where classical LP
systems must bolt on constraint solvers, probabilistic inference, or coinductive
reasoning as special-case extensions, a propagator network with pluggable lattices
can express all of these as instances of the same fixpoint computation.

This document surveys seven major extension axes and one integrative frontier:

1. Mode prefixes on logic variables (=+=, =-=, =?=)
2. Domain-constrained logic variables (=?x:DomainType=)
3. Co-inductive logic programming and greatest fixpoints
4. Rule learning and inductive logic programming
5. Probabilistic logic programming
6. Category-theoretic foundations
7. Novel directions (linear LP, temporal LP, epistemic LP, abduction, ASP, CHR, tabling)
8. The frontier: what a fresh redesign of LP looks like

Each section connects back to Prologos's existing infrastructure with concrete
implementation considerations.

** Existing Infrastructure Reference

| Module           | Role                                       | Key Abstractions                                      |
|------------------+--------------------------------------------+-------------------------------------------------------|
| =propagator.rkt= | Persistent propagator network              | =prop-cell=, =propagator=, =prop-network=, =cell-id=   |
| =bilattice.rkt=  | Three-valued reasoning (WFS)               | =lattice-desc=, =bilattice-var=, =bool-lattice=        |
| =atms.rkt=       | Assumption-based truth maintenance         | =assumption=, =supported-value=, =tms-cell=, =atms=    |
| =tabling.rkt=    | SLG-style memoization                      | =table-entry=, =table-store=, =wf-table-entry=         |
| =wf-engine.rkt=  | Well-founded semantics orchestration       | =wf-answer=, =wf-naf-oracle=, bilattice fixpoint loop  |
| =relations.rkt=  | Relation registry and DFS solver           | =relation-info=, =solve-goal=, =explain-goal=          |
| =solver.rkt=     | Solver configuration                       | =solver-config=, strategy/threshold/tabling/provenance  |
| =narrowing.rkt=  | Narrowing search (functional-logic bridge) | Value ordering, constraint propagation                  |
| =provenance.rkt= | Derivation chain tracking                  | Explanation trees, derivation depth                     |

* Mode Prefixes on Logic Variables

** Background: What Modes Are

In logic programming, a /mode/ declaration specifies the intended data-flow
pattern of a predicate's arguments:

- =+= (input): the argument is ground (fully instantiated) on entry
- =-= (output): the argument is free on entry and will be bound by the predicate
- =?= (unknown): the argument may be either ground or free

Mercury pioneered mandatory mode declarations with determinism inference. Ciao
Prolog uses a rich assertion language where modes are optional but enable powerful
static analysis via CiaoPP. Both systems demonstrate that modes unlock significant
optimization opportunities.

** Mercury's Mode System

Mercury's execution algorithm exploits modes in several ways:

- *Determinism categories*: From modes, Mercury infers whether a predicate is
  =det= (exactly one solution), =semidet= (zero or one), =multi= (one or more),
  or =nondet= (zero or more). Deterministic predicates compile to simple function
  calls with no backtracking machinery.
- *Clause selection*: For =det=/=semidet= predicates with input arguments, the
  compiler generates switch statements or hash lookups instead of sequential
  clause search.
- *Argument reordering*: The compiler may reorder goals within a clause body to
  ensure input arguments are ground before they are needed, potentially converting
  =nondet= goals to =semidet= ones.
- *Specialization*: Multiple modes for the same predicate generate separate
  compiled versions (e.g., =append(+, +, -)= vs =append(-, -, +)=).

** Ciao's Assertion Language

Ciao's approach is more flexible: modes are expressed as assertions that serve
both as documentation and as targets for static/dynamic verification. CiaoPP
infers types, modes, sharing, determinacy, non-failure, and resource bounds.

The assertion language supports properties like:
- =:- pred append(+list, +list, -list).= --- mode declaration
- =:- check comp append(X, Y, Z) : (ground(X), ground(Y)) => ground(Z).= --- conditional mode

** Proposed Prologos Syntax

#+begin_src prologos
;; Mode-annotated relation
defr append {A : Type}
  | [+xs : List A] [+ys : List A] [-zs : List A]
  ;; Ground inputs, free output -- deterministic append

;; Multi-mode relation
defr member {A : Type}
  | [+x : A] [+xs : List A]         ;; membership test (semidet)
  | [-x : A] [+xs : List A]         ;; enumeration (nondet)

;; Solver can exploit mode information
solve [member ?who '[:alice :bob :carol]]
;; With ?who free and the list ground, the solver enumerates (nondet mode)

solve [member :bob +known-list]
;; With both ground, the solver does a membership test (semidet mode)
#+end_src

** Determinism Inference from Modes

| Input Modes       | Pattern     | Determinism | Optimization                           |
|--------------------+-------------+-------------+----------------------------------------|
| All =+=            | First-match | =det=       | Compile to function call               |
| All =+= but last  | Generate    | =semidet=   | Single-solution search, cut on success |
| Mix of =+=, =-=   | Search      | =multi=     | Indexed on =+= args, enumerate =-= args |
| All =-=            | Enumerate   | =nondet=    | Full backtracking search               |

** Composition with the Propagator Network

Modes interact with Prologos's propagator network in two ways:

1. *Cell initialization*: A =+= argument maps to a propagator cell initialized
   with a ground value (=net-cell-write= at construction). A =-= argument maps
   to a cell initialized at =bot=. A =?= argument maps to a cell that may or
   may not have an initial value.

2. *Propagation direction*: Mode analysis determines which propagators fire
   first. In a clause like =append(+X, +Y, -Z)=, the propagator that computes
   =Z= from =X= and =Y= should fire eagerly (forward propagation). In
   =append(-X, -Y, +Z)=, the reverse propagators decomposing =Z= should fire.

3. *Determinism as lattice metadata*: The determinism category of a goal
   (=det=, =semidet=, =multi=, =nondet=) can be tracked as metadata on the
   propagator cell, allowing the scheduler (=run-to-quiescence=) to prioritize
   deterministic propagations.

