docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
% Created 2026-03-16 Mon 07:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Prologos Research}
\date{2026-03-16}
\title{Next-Generation Logic Programming: Beyond Prolog in a Propagator-First Architecture}
\hypersetup{
 pdfauthor={Prologos Research},
 pdftitle={Next-Generation Logic Programming: Beyond Prolog in a Propagator-First Architecture},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{3}
\tableofcontents

\section{Introduction}
\label{sec:org8580cbc}

Prologos already has a relational sublanguage (\texttt{defr}, \texttt{rel}, \texttt{solve}, \texttt{explain})
backed by a persistent propagator network, bilattice-based well-founded semantics,
SLG-style tabling, ATMS-based assumption management, and narrowing. This document
explores how to extend this foundation beyond a Prolog port into a genuinely
next-generation logic programming system.

The key insight is that Prologos's propagator-first architecture is not merely an
implementation detail---it is a \emph{design space multiplier}. Where classical LP
systems must bolt on constraint solvers, probabilistic inference, or coinductive
reasoning as special-case extensions, a propagator network with pluggable lattices
can express all of these as instances of the same fixpoint computation.

This document surveys seven major extension axes and one integrative frontier:

\begin{enumerate}
\item Mode prefixes on logic variables (\texttt{+}, \texttt{-}, \texttt{?})
\item Domain-constrained logic variables (\texttt{?x:DomainType})
\item Co-inductive logic programming and greatest fixpoints
\item Rule learning and inductive logic programming
\item Probabilistic logic programming
\item Category-theoretic foundations
\item Novel directions (linear LP, temporal LP, epistemic LP, abduction, ASP, CHR, tabling)
\item The frontier: what a fresh redesign of LP looks like
\end{enumerate}

Each section connects back to Prologos's existing infrastructure with concrete
implementation considerations.
\subsection{Existing Infrastructure Reference}
\label{sec:org89bb739}

\begin{center}
\begin{tabular}{lll}
Module & Role & Key Abstractions\\
\hline
\texttt{propagator.rkt} & Persistent propagator network & \texttt{prop-cell}, \texttt{propagator}, \texttt{prop-network}, \texttt{cell-id}\\
\texttt{bilattice.rkt} & Three-valued reasoning (WFS) & \texttt{lattice-desc}, \texttt{bilattice-var}, \texttt{bool-lattice}\\
\texttt{atms.rkt} & Assumption-based truth maintenance & \texttt{assumption}, \texttt{supported-value}, \texttt{tms-cell}, \texttt{atms}\\
\texttt{tabling.rkt} & SLG-style memoization & \texttt{table-entry}, \texttt{table-store}, \texttt{wf-table-entry}\\
\texttt{wf-engine.rkt} & Well-founded semantics orchestration & \texttt{wf-answer}, \texttt{wf-naf-oracle}, bilattice fixpoint loop\\
\texttt{relations.rkt} & Relation registry and DFS solver & \texttt{relation-info}, \texttt{solve-goal}, \texttt{explain-goal}\\
\texttt{solver.rkt} & Solver configuration & \texttt{solver-config}, strategy/threshold/tabling/provenance\\
\texttt{narrowing.rkt} & Narrowing search (functional-logic bridge) & Value ordering, constraint propagation\\
\texttt{provenance.rkt} & Derivation chain tracking & Explanation trees, derivation depth\\
\end{tabular}
\end{center}
\section{Mode Prefixes on Logic Variables}
\label{sec:org58cbd66}

\subsection{Background: What Modes Are}
\label{sec:org78647e8}

In logic programming, a \emph{mode} declaration specifies the intended data-flow
pattern of a predicate's arguments:

\begin{itemize}
\item \texttt{+} (input): the argument is ground (fully instantiated) on entry
\item \texttt{-} (output): the argument is free on entry and will be bound by the predicate
\item \texttt{?} (unknown): the argument may be either ground or free
\end{itemize}

Mercury pioneered mandatory mode declarations with determinism inference. Ciao
Prolog uses a rich assertion language where modes are optional but enable powerful
static analysis via CiaoPP. Both systems demonstrate that modes unlock significant
optimization opportunities.
\subsection{Mercury's Mode System}
\label{sec:org9ba4e2d}

Mercury's execution algorithm exploits modes in several ways:

\begin{itemize}
\item \textbf{Determinism categories}: From modes, Mercury infers whether a predicate is
\texttt{det} (exactly one solution), \texttt{semidet} (zero or one), \texttt{multi} (one or more),
or \texttt{nondet} (zero or more). Deterministic predicates compile to simple function
calls with no backtracking machinery.
\item \textbf{Clause selection}: For \texttt{det=/=semidet} predicates with input arguments, the
compiler generates switch statements or hash lookups instead of sequential
clause search.
\item \textbf{Argument reordering}: The compiler may reorder goals within a clause body to
ensure input arguments are ground before they are needed, potentially converting
\texttt{nondet} goals to \texttt{semidet} ones.
\item \textbf{Specialization}: Multiple modes for the same predicate generate separate
compiled versions (e.g., \texttt{append(+, +, -)} vs \texttt{append(-, -, +)}).
\end{itemize}
\subsection{Ciao's Assertion Language}
\label{sec:org2e63603}

Ciao's approach is more flexible: modes are expressed as assertions that serve
both as documentation and as targets for static/dynamic verification. CiaoPP
infers types, modes, sharing, determinacy, non-failure, and resource bounds.

The assertion language supports properties like:
\begin{itemize}
\item \texttt{:- pred append(+list, +list, -list).} --- mode declaration
\item \texttt{:- check comp append(X, Y, Z) : (ground(X), ground(Y)) => ground(Z).} --- conditional mode
\end{itemize}
\subsection{Proposed Prologos Syntax}
\label{sec:orgdcf5a0b}

\begin{verbatim}
;; Mode-annotated relation
defr append {A : Type}
  | [+xs : List A] [+ys : List A] [-zs : List A]
  ;; Ground inputs, free output -- deterministic append

;; Multi-mode relation
defr member {A : Type}
  | [+x : A] [+xs : List A]         ;; membership test (semidet)
  | [-x : A] [+xs : List A]         ;; enumeration (nondet)

;; Solver can exploit mode information
solve [member ?who '[:alice :bob :carol]]
;; With ?who free and the list ground, the solver enumerates (nondet mode)

solve [member :bob +known-list]
;; With both ground, the solver does a membership test (semidet mode)
\end{verbatim}
\subsection{Determinism Inference from Modes}
\label{sec:org0c5c5b2}

\begin{center}
\begin{tabular}{llll}
Input Modes & Pattern & Determinism & Optimization\\
\hline
All \texttt{+} & First-match & \texttt{det} & Compile to function call\\
All \texttt{+} but last & Generate & \texttt{semidet} & Single-solution search, cut on success\\
Mix of \texttt{+}, \texttt{-} & Search & \texttt{multi} & Indexed on \texttt{+} args, enumerate \texttt{-} args\\
All \texttt{-} & Enumerate & \texttt{nondet} & Full backtracking search\\
\end{tabular}
\end{center}
\subsection{Composition with the Propagator Network}
\label{sec:org28d94c6}

Modes interact with Prologos's propagator network in two ways:

\begin{enumerate}
\item \textbf{Cell initialization}: A \texttt{+} argument maps to a propagator cell initialized
with a ground value (\texttt{net-cell-write} at construction). A \texttt{-} argument maps
to a cell initialized at \texttt{bot}. A \texttt{?} argument maps to a cell that may or
may not have an initial value.

\item \textbf{Propagation direction}: Mode analysis determines which propagators fire
first. In a clause like \texttt{append(+X, +Y, -Z)}, the propagator that computes
\texttt{Z} from \texttt{X} and \texttt{Y} should fire eagerly (forward propagation). In
\texttt{append(-X, -Y, +Z)}, the reverse propagators decomposing \texttt{Z} should fire.

\item \textbf{Determinism as lattice metadata}: The determinism category of a goal
(\texttt{det}, \texttt{semidet}, \texttt{multi}, \texttt{nondet}) can be tracked as metadata on the
propagator cell, allowing the scheduler (\texttt{run-to-quiescence}) to prioritize
deterministic propagations.
\end{enumerate}
