docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.org
** Implementation Roadmap

1. Parse mode prefixes (=+=, =-=, =?=) in =defr= parameter lists
2. Extend =param-info= in =relations.rkt= with a =mode= field
3. Add determinism inference in a new =mode-analysis.rkt= module
4. Modify =solve-goal= to select clause ordering and indexing based on modes
5. Generate specialized propagator networks per mode combination

* Domain-Constrained Logic Variables

** Background: CLP(X) Family

Classical Prolog treats logic variables as untyped, unifiable terms. The CLP(X)
family parameterizes the solver over a constraint domain X:

| Domain    | Variables Over | Constraints           | Solving Technique          |
|-----------+----------------+-----------------------+----------------------------|
| CLP(FD)   | Finite integers| =X #> Y=, =X in 1..10= | Arc consistency, propagation |
| CLP(R)    | Real numbers   | =X > 3.14=, =X + Y =:= 5.0= | Simplex, interval arithmetic |
| CLP(Q)    | Rationals      | Same as CLP(R)        | Exact rational arithmetic  |
| CLP(Set)  | Finite sets    | =X subset Y=, =card(X) = 3= | Set-interval propagation   |
| CLP(Bool) | Booleans       | =X #\/ Y=, =X #/\ Z= | BDD, SAT                   |
| CLP(S)    | Strings        | =concat(X, Y, Z)=    | String constraint solvers  |

** Proposed Prologos Syntax

#+begin_src prologos
;; Domain-constrained logic variable
defr schedule
  | [?room : FD 1..10] [?time : FD 0..23] [?course : Symbol]

;; Constraints use trait-based dispatch
rel schedule
  | [?r ?t :math101]  :- [?t > 8N] [?t < 17N]
  | [?r ?t :phys201]  :- [?t > 9N] [?t < 18N] [?r /= 5N]

;; Real-valued constraints
defr trajectory
  | [?x : Real] [?y : Real] [?t : Real 0.0..100.0]
  :- [?y = [?x * ?x]] [?t >= 0.0]
#+end_src

** Arc Consistency and Bounds Propagation as Propagator Cells

The key insight is that CLP constraint propagation /is/ propagator network
computation:

- An FD variable =?x : FD 1..10= maps to a propagator cell whose value is a
  domain representation (e.g., a sorted interval list or bitset). The lattice
  is the /reverse inclusion order/ on domains: removing values from the domain
  is the monotone operation (domain shrinks over time).

- Arc consistency for a binary constraint =c(X, Y)= is a propagator watching
  =X= and =Y=: when =X='s domain shrinks, it filters =Y='s domain (and vice
  versa). This is exactly a two-input, two-output propagator in the network.

- Bounds propagation is a coarser version: the cell stores only =[lo, hi]= and
  the propagator updates bounds. This maps to a simpler lattice (pairs of
  integers with component-wise narrowing).

** Lattice Instances for Constraint Domains

These connect directly to the lattice catalog (=docs/research/2026-03-14_LATTICE_CATALOG.org=):

| Domain  | Cell Lattice                | Merge (=join=)         | Bot            | Top                |
|---------+-----------------------------+------------------------+----------------+--------------------|
| FD      | Reverse powerset            | Intersection           | Full domain    | Empty set (=!)     |
| Bounds  | Interval =\[lo, hi\]=       | Narrow =[max lo, min hi]= | =[-inf, +inf]= | Empty interval     |
| Real    | Interval arithmetic         | Narrow                 | =(-inf, +inf)= | Empty              |
| Set     | Set intervals =[lb, ub]=    | Narrow both bounds     | =[empty, U]=   | =lb > ub=          |
| Boolean | Trilean ={T, F, unknown}=   | Refine                 | =unknown=      | Contradiction      |

** Composition with ATMS

Domain constraints compose with the ATMS (=atms.rkt=) for speculative reasoning:

#+begin_src prologos
;; Under different assumptions, a variable may have different domains
solve [schedule ?room ?time :math101]
  assuming { room-available 3 }
  ;; ATMS tracks: {room-available 3} => room domain shrinks to {3}
  ;; Other worldviews may have different domain states
#+end_src

Each =supported-value= in a =tms-cell= can carry a domain state. The ATMS
manages which domain states are consistent with which assumption sets,
enabling the solver to explore multiple constraint scenarios simultaneously.

** Implementation Roadmap

1. Define =domain-cell= constructors in =propagator.rkt= (FD, bounds, interval)
2. Implement constraint propagators (arc-consistency, bounds-propagation)
3. Extend =?x:Type= syntax in the relational parser to accept domain annotations
4. Add domain-aware unification in the solver (=unify= + domain narrowing)
5. Connect to the existing =narrowing.rkt= infrastructure

* Co-Inductive Logic Programming and Greatest Fixpoints

** Background: Coinduction as Dual of Induction

Standard logic programming computes /least fixpoints/ (lfp): start from nothing,
build up derivable facts by applying clauses bottom-up until no new facts emerge.
Co-inductive logic programming computes /greatest fixpoints/ (gfp): start from
everything, eliminate non-derivable facts top-down.

The duality:
- *Induction* (lfp): finite derivation trees, well-founded recursion, Herbrand models
- *Coinduction* (gfp): potentially infinite proof trees, corecursion, regular trees

** CoLP: Coinductive Hypothesis Rule

Gupta, Bansal, and Simon (2007) introduced CoLP with the /coinductive hypothesis
rule/: when proving a goal =G=, if =G= already appears as an ancestor in the
current proof search, succeed (coinductive hypothesis) rather than failing
(inductive loop detection).

This enables:

#+begin_src prologos
;; Coinductive definition of infinite streams
:coinductive
defr stream-of
  | [?s : Stream A] [?a : A]

rel stream-of
  | [?s ?a] :- [head ?s ?a] [tail ?s ?rest] [stream-of ?rest ?a]
  ;; Under coinduction, stream-of [ones 1N] succeeds for ones = 1 :: ones

;; Bisimulation as coinductive equality
:coinductive
defr bisimilar
  | [?s1 : Stream A] [?s2 : Stream A]

rel bisimilar
  | [?s1 ?s2] :- [head ?s1 ?h] [head ?s2 ?h]
                  [tail ?s1 ?t1] [tail ?s2 ?t2]
                  [bisimilar ?t1 ?t2]
#+end_src

** Flexible Coinduction: Coclauses

Ancona, Barbieri, and Zucca (2020) introduced /coclauses/ that allow tuning the
coinductive behavior per-predicate. A coclause is matched when a coinductive
hypothesis fires, allowing the user to specify /what/ should happen when a loop
is detected rather than always succeeding.

#+begin_src prologos
;; Flexible coinduction with coclause
:coinductive
defr subtype
  | [?a : Type] [?b : Type]

;; Regular clauses (inductive base cases)
rel subtype
  | [:Nat :Int]
  | [[List ?a] [List ?b]] :- [subtype ?a ?b]

;; Coclause: when coinductive hypothesis fires, check structural compatibility
coclause subtype
  | [?a ?b] :- [structural-compat ?a ?b]
#+end_src

