docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
\subsection{Implementation Roadmap}
\label{sec:org1e92642}

\begin{enumerate}
\item Parse mode prefixes (\texttt{+}, \texttt{-}, \texttt{?}) in \texttt{defr} parameter lists
\item Extend \texttt{param-info} in \texttt{relations.rkt} with a \texttt{mode} field
\item Add determinism inference in a new \texttt{mode-analysis.rkt} module
\item Modify \texttt{solve-goal} to select clause ordering and indexing based on modes
\item Generate specialized propagator networks per mode combination
\end{enumerate}
\section{Domain-Constrained Logic Variables}
\label{sec:orgb85bb10}

\subsection{Background: CLP(X) Family}
\label{sec:org5af9141}

Classical Prolog treats logic variables as untyped, unifiable terms. The CLP(X)
family parameterizes the solver over a constraint domain X:

\begin{center}
\begin{tabular}{llll}
Domain & Variables Over & Constraints & Solving Technique\\
\hline
CLP(FD) & Finite integers & \texttt{X \#> Y}, \texttt{X in 1..10} & Arc consistency, propagation\\
CLP(R) & Real numbers & \texttt{X > 3.14}, \texttt{X + Y =:} 5.0= & Simplex, interval arithmetic\\
CLP(Q) & Rationals & Same as CLP(R) & Exact rational arithmetic\\
CLP(Set) & Finite sets & \texttt{X subset Y}, \texttt{card(X) = 3} & Set-interval propagation\\
CLP(Bool) & Booleans & \texttt{X \#\textbackslash{}/ Y}, \texttt{X \#/\textbackslash{} Z} & BDD, SAT\\
CLP(S) & Strings & \texttt{concat(X, Y, Z)} & String constraint solvers\\
\end{tabular}
\end{center}
\subsection{Proposed Prologos Syntax}
\label{sec:org2147629}

\begin{verbatim}
;; Domain-constrained logic variable
defr schedule
  | [?room : FD 1..10] [?time : FD 0..23] [?course : Symbol]

;; Constraints use trait-based dispatch
rel schedule
  | [?r ?t :math101]  :- [?t > 8N] [?t < 17N]
  | [?r ?t :phys201]  :- [?t > 9N] [?t < 18N] [?r /= 5N]

;; Real-valued constraints
defr trajectory
  | [?x : Real] [?y : Real] [?t : Real 0.0..100.0]
  :- [?y = [?x * ?x]] [?t >= 0.0]
\end{verbatim}
\subsection{Arc Consistency and Bounds Propagation as Propagator Cells}
\label{sec:org92cc26b}

The key insight is that CLP constraint propagation \emph{is} propagator network
computation:

\begin{itemize}
\item An FD variable \texttt{?x : FD 1..10} maps to a propagator cell whose value is a
domain representation (e.g., a sorted interval list or bitset). The lattice
is the \emph{reverse inclusion order} on domains: removing values from the domain
is the monotone operation (domain shrinks over time).

\item Arc consistency for a binary constraint \texttt{c(X, Y)} is a propagator watching
\texttt{X} and \texttt{Y}: when \texttt{X}'s domain shrinks, it filters \texttt{Y}'s domain (and vice
versa). This is exactly a two-input, two-output propagator in the network.

\item Bounds propagation is a coarser version: the cell stores only \texttt{[lo, hi]} and
the propagator updates bounds. This maps to a simpler lattice (pairs of
integers with component-wise narrowing).
\end{itemize}
\subsection{Lattice Instances for Constraint Domains}
\label{sec:orgf6ec7e3}

These connect directly to the lattice catalog (\texttt{docs/research/2026-03-14\_LATTICE\_CATALOG.org}):

\begin{center}
\begin{tabular}{lllll}
Domain & Cell Lattice & Merge (\texttt{join}) & Bot & Top\\
\hline
FD & Reverse powerset & Intersection & Full domain & Empty set (=!)\\
Bounds & Interval \texttt{\textbackslash{}[lo, hi\textbackslash{}]} & Narrow \texttt{[max lo, min hi]} & \texttt{[-inf, +inf]} & Empty interval\\
Real & Interval arithmetic & Narrow & \texttt{(-inf, +inf)} & Empty\\
Set & Set intervals \texttt{[lb, ub]} & Narrow both bounds & \texttt{[empty, U]} & \texttt{lb > ub}\\
Boolean & Trilean \texttt{\{T, F, unknown\}} & Refine & \texttt{unknown} & Contradiction\\
\end{tabular}
\end{center}
\subsection{Composition with ATMS}
\label{sec:org76d9b68}

Domain constraints compose with the ATMS (\texttt{atms.rkt}) for speculative reasoning:

\begin{verbatim}
;; Under different assumptions, a variable may have different domains
solve [schedule ?room ?time :math101]
  assuming { room-available 3 }
  ;; ATMS tracks: {room-available 3} => room domain shrinks to {3}
  ;; Other worldviews may have different domain states
\end{verbatim}

Each \texttt{supported-value} in a \texttt{tms-cell} can carry a domain state. The ATMS
manages which domain states are consistent with which assumption sets,
enabling the solver to explore multiple constraint scenarios simultaneously.
\subsection{Implementation Roadmap}
\label{sec:org3827cf6}

\begin{enumerate}
\item Define \texttt{domain-cell} constructors in \texttt{propagator.rkt} (FD, bounds, interval)
\item Implement constraint propagators (arc-consistency, bounds-propagation)
\item Extend \texttt{?x:Type} syntax in the relational parser to accept domain annotations
\item Add domain-aware unification in the solver (\texttt{unify} + domain narrowing)
\item Connect to the existing \texttt{narrowing.rkt} infrastructure
\end{enumerate}
\section{Co-Inductive Logic Programming and Greatest Fixpoints}
\label{sec:orgaa8daef}

\subsection{Background: Coinduction as Dual of Induction}
\label{sec:org287422e}

Standard logic programming computes \emph{least fixpoints} (lfp): start from nothing,
build up derivable facts by applying clauses bottom-up until no new facts emerge.
Co-inductive logic programming computes \emph{greatest fixpoints} (gfp): start from
everything, eliminate non-derivable facts top-down.

The duality:
\begin{itemize}
\item \textbf{Induction} (lfp): finite derivation trees, well-founded recursion, Herbrand models
\item \textbf{Coinduction} (gfp): potentially infinite proof trees, corecursion, regular trees
\end{itemize}
\subsection{CoLP: Coinductive Hypothesis Rule}
\label{sec:orgb20be60}

Gupta, Bansal, and Simon (2007) introduced CoLP with the \emph{coinductive hypothesis
rule}: when proving a goal \texttt{G}, if \texttt{G} already appears as an ancestor in the
current proof search, succeed (coinductive hypothesis) rather than failing
(inductive loop detection).

This enables:

\begin{verbatim}
;; Coinductive definition of infinite streams
:coinductive
defr stream-of
  | [?s : Stream A] [?a : A]

rel stream-of
  | [?s ?a] :- [head ?s ?a] [tail ?s ?rest] [stream-of ?rest ?a]
  ;; Under coinduction, stream-of [ones 1N] succeeds for ones = 1 :: ones

;; Bisimulation as coinductive equality
:coinductive
defr bisimilar
  | [?s1 : Stream A] [?s2 : Stream A]

rel bisimilar
  | [?s1 ?s2] :- [head ?s1 ?h] [head ?s2 ?h]
                  [tail ?s1 ?t1] [tail ?s2 ?t2]
                  [bisimilar ?t1 ?t2]
\end{verbatim}
\subsection{Flexible Coinduction: Coclauses}
\label{sec:org1366910}

Ancona, Barbieri, and Zucca (2020) introduced \emph{coclauses} that allow tuning the
coinductive behavior per-predicate. A coclause is matched when a coinductive
hypothesis fires, allowing the user to specify \emph{what} should happen when a loop
is detected rather than always succeeding.

\begin{verbatim}
;; Flexible coinduction with coclause
:coinductive
defr subtype
  | [?a : Type] [?b : Type]

;; Regular clauses (inductive base cases)
rel subtype
  | [:Nat :Int]
  | [[List ?a] [List ?b]] :- [subtype ?a ?b]

;; Coclause: when coinductive hypothesis fires, check structural compatibility
coclause subtype
  | [?a ?b] :- [structural-compat ?a ?b]
\end{verbatim}
