docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.org
** Composition with Bilattice (Well-Founded Engine)

The existing bilattice infrastructure in =bilattice.rkt= already provides the
dual ascending/descending cell pairs needed for coinductive reasoning:

- *Ascending cell* (lfp direction): accumulates evidence FOR a predicate being
  true. This is standard inductive LP.
- *Descending cell* (gfp direction): starts at =top= and eliminates evidence
  AGAINST a predicate being true. This is the coinductive direction.

The bilattice reading at quiescence gives exactly the three-valued approximation
needed:
- =lower = upper = true=: predicate is both inductively and coinductively true
- =lower = false, upper = true=: unknown (gap) --- the predicate might be true
  coinductively but has no finite inductive proof
- =lower = upper = false=: definitively false even coinductively

The =wf-engine.rkt= iterative fixpoint loop already alternates between bottom-up
and top-down phases. Extending it with coinductive hypothesis detection requires:

1. Maintaining a /coinductive stack/ during DFS proof search
2. When a goal matches an ancestor, consult the bilattice upper cell
3. If upper cell is =true= (not yet refuted), succeed coinductively
4. The refutation phase may later push the upper cell to =false=

** Coinductive Session Types

Prologos has session types. Session types are naturally coinductive (a server
loop is an infinite protocol). Coinductive LP enables:

#+begin_src prologos
;; Session type as coinductive predicate
:coinductive
defr conforms
  | [?process : Process] [?session : Session]

rel conforms
  | [?p ?s] :- [step ?p ?action ?p'] [transition ?s ?action ?s']
                [conforms ?p' ?s']
;; Coinductive: the process conforms if it can always make a matching step
#+end_src

** Implementation Roadmap

1. Add =:coinductive= annotation to =defr= (in =relation-info=, new field)
2. Track coinductive ancestor stack in the DFS solver
3. Connect to bilattice upper cell for coinductive hypothesis resolution
4. Implement coclause syntax and matching
5. Test with session type conformance checking

* Rule Learning and Inductive Logic Programming

** Background: ILP Systems

Inductive Logic Programming (ILP) learns logic programs (rules) from examples
and background knowledge. The major modern systems:

| System   | Method                | Language     | Key Feature                        |
|----------+-----------------------+--------------+------------------------------------|
| Metagol  | Meta-interpretive     | Prolog       | Metarule-guided search, predicate invention |
| ILASP    | ASP-based             | ASP          | Optimal w.r.t. cost functions      |
| Popper   | Hypothesis testing    | Prolog + ASP | Generate-test-constrain loop       |
| Louise   | Polynomial MIL        | Prolog       | Scalable meta-interpretive learning |
| FastLAS  | Fast ILASP variant    | ASP          | Noise-tolerant                     |

** Meta-Interpretive Learning (MIL)

MIL learns by specializing /metarules/---higher-order clause templates:

#+begin_src prolog
%% Metarule: chain
metarule(chain, [P,Q,R], [P,A,B] :- [[Q,A,C],[R,C,B]]).
%% "P(A,B) :- Q(A,C), R(C,B)" — learn transitive compositions
#+end_src

The hypothesis space is controlled by the set of available metarules.
Typed MIL (MetagolT) uses type checking to prune the search space by a
cubic factor.

** Proposed Prologos Surface Syntax for ILP

#+begin_src prologos
;; Define a learning task
learn grandparent
  from-examples
    [grandparent :alice :carol] ;; positive
    [grandparent :alice :dave]  ;; positive
  negative-examples
    [grandparent :alice :alice] ;; negative
  background
    parent member
  metarules
    chain identity
  max-clauses 3

;; The system would synthesize:
;; rel grandparent | [?x ?z] :- [parent ?x ?y] [parent ?y ?z]
#+end_src

** Differentiable ILP

Recent work (NeuralLP, DRUM, and GLIDR) embeds ILP in differentiable
frameworks. Key ideas:

- Clause selection is parameterized by continuous weights (softmax over metarules)
- Forward chaining is differentiable (matrix operations over relation adjacency)
- Gradient descent optimizes rule weights against example loss

This connects to Prologos through the propagator network:

- Each candidate clause becomes a propagator with a continuous weight
- The weight lives in a propagator cell over a =\[0,1\]= lattice
- Gradient information flows backward through the network (counter-propagation)
- The ATMS tracks which clause combinations are consistent

#+begin_src prologos
;; Differentiable ILP as weighted clauses
learn-differentiable path
  from-data edge-triples
  metarules [chain identity inverse]
  optimizer :adam
  epochs 100
  ;; Each learned clause gets a weight:
  ;; rel path | [?x ?y] :- [edge ?x ?y]        ;; weight 0.95
  ;; rel path | [?x ?z] :- [edge ?x ?y] [path ?y ?z]  ;; weight 0.88
#+end_src

** Composition with Propagator Networks

ILP as propagator computation:

1. *Hypothesis space as lattice*: The set of candidate programs, ordered by
   generality (more general = higher). Learning descends from the most general
   hypothesis.
2. *Example propagators*: Each positive/negative example is a propagator that
   constrains the hypothesis space (positive: must cover; negative: must not cover).
3. *Metarule propagators*: Each metarule instantiation is a propagator that
   adds a candidate clause to the hypothesis.
4. *Pruning propagators*: Constraint propagation eliminates inconsistent
   hypothesis subspaces.

The ATMS is particularly valuable here: each candidate clause is an assumption,
and nogoods track clause combinations that violate negative examples.

** Implementation Roadmap

1. Define =learn= top-level form and metarule syntax
2. Implement metarule-guided search as propagator network construction
3. Connect to ATMS for hypothesis tracking (clauses as assumptions)
4. Add differentiable ILP as a solver strategy (=:optimizer= config)
5. Bridge to the type system (typed MIL uses Prologos's type inference)

* Probabilistic Logic Programming

** Background: ProbLog and the Distribution Semantics

ProbLog (KU Leuven) extends Prolog with probabilistic facts:

#+begin_src prolog
0.3 :: burglary.
0.1 :: earthquake.
alarm :- burglary.
alarm :- earthquake.
#+end_src

The /distribution semantics/: each probabilistic fact independently true/false
with its stated probability. A ground query's probability is the sum over all
possible worlds where it is derivable, weighted by world probability.

Inference uses /knowledge compilation/: the derivation structure is compiled to
a Boolean formula (SDD, BDD, or d-DNNF), then weighted model counting computes
the probability.

