docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
\subsection{Composition with Bilattice (Well-Founded Engine)}
\label{sec:org01b6ede}

The existing bilattice infrastructure in \texttt{bilattice.rkt} already provides the
dual ascending/descending cell pairs needed for coinductive reasoning:

\begin{itemize}
\item \textbf{Ascending cell} (lfp direction): accumulates evidence FOR a predicate being
true. This is standard inductive LP.
\item \textbf{Descending cell} (gfp direction): starts at \texttt{top} and eliminates evidence
AGAINST a predicate being true. This is the coinductive direction.
\end{itemize}

The bilattice reading at quiescence gives exactly the three-valued approximation
needed:
\begin{itemize}
\item \texttt{lower = upper = true}: predicate is both inductively and coinductively true
\item \texttt{lower = false, upper = true}: unknown (gap) --- the predicate might be true
coinductively but has no finite inductive proof
\item \texttt{lower = upper = false}: definitively false even coinductively
\end{itemize}

The \texttt{wf-engine.rkt} iterative fixpoint loop already alternates between bottom-up
and top-down phases. Extending it with coinductive hypothesis detection requires:

\begin{enumerate}
\item Maintaining a \emph{coinductive stack} during DFS proof search
\item When a goal matches an ancestor, consult the bilattice upper cell
\item If upper cell is \texttt{true} (not yet refuted), succeed coinductively
\item The refutation phase may later push the upper cell to \texttt{false}
\end{enumerate}
\subsection{Coinductive Session Types}
\label{sec:org11fad71}

Prologos has session types. Session types are naturally coinductive (a server
loop is an infinite protocol). Coinductive LP enables:

\begin{verbatim}
;; Session type as coinductive predicate
:coinductive
defr conforms
  | [?process : Process] [?session : Session]

rel conforms
  | [?p ?s] :- [step ?p ?action ?p'] [transition ?s ?action ?s']
                [conforms ?p' ?s']
;; Coinductive: the process conforms if it can always make a matching step
\end{verbatim}
\subsection{Implementation Roadmap}
\label{sec:orgf5052c0}

\begin{enumerate}
\item Add \texttt{:coinductive} annotation to \texttt{defr} (in \texttt{relation-info}, new field)
\item Track coinductive ancestor stack in the DFS solver
\item Connect to bilattice upper cell for coinductive hypothesis resolution
\item Implement coclause syntax and matching
\item Test with session type conformance checking
\end{enumerate}
\section{Rule Learning and Inductive Logic Programming}
\label{sec:orgf2296af}

\subsection{Background: ILP Systems}
\label{sec:org0b9bc2e}

Inductive Logic Programming (ILP) learns logic programs (rules) from examples
and background knowledge. The major modern systems:

\begin{center}
\begin{tabular}{llll}
System & Method & Language & Key Feature\\
\hline
Metagol & Meta-interpretive & Prolog & Metarule-guided search, predicate invention\\
ILASP & ASP-based & ASP & Optimal w.r.t. cost functions\\
Popper & Hypothesis testing & Prolog + ASP & Generate-test-constrain loop\\
Louise & Polynomial MIL & Prolog & Scalable meta-interpretive learning\\
FastLAS & Fast ILASP variant & ASP & Noise-tolerant\\
\end{tabular}
\end{center}
\subsection{Meta-Interpretive Learning (MIL)}
\label{sec:org94f630a}

MIL learns by specializing \emph{metarules}---higher-order clause templates:

\begin{verbatim}
%% Metarule: chain
metarule(chain, [P,Q,R], [P,A,B] :- [[Q,A,C],[R,C,B]]).
%% "P(A,B) :- Q(A,C), R(C,B)" — learn transitive compositions
\end{verbatim}

The hypothesis space is controlled by the set of available metarules.
Typed MIL (MetagolT) uses type checking to prune the search space by a
cubic factor.
\subsection{Proposed Prologos Surface Syntax for ILP}
\label{sec:orgf0fdc76}

\begin{verbatim}
;; Define a learning task
learn grandparent
  from-examples
    [grandparent :alice :carol] ;; positive
    [grandparent :alice :dave]  ;; positive
  negative-examples
    [grandparent :alice :alice] ;; negative
  background
    parent member
  metarules
    chain identity
  max-clauses 3

;; The system would synthesize:
;; rel grandparent | [?x ?z] :- [parent ?x ?y] [parent ?y ?z]
\end{verbatim}
\subsection{Differentiable ILP}
\label{sec:org295b23f}

Recent work (NeuralLP, DRUM, and GLIDR) embeds ILP in differentiable
frameworks. Key ideas:

\begin{itemize}
\item Clause selection is parameterized by continuous weights (softmax over metarules)
\item Forward chaining is differentiable (matrix operations over relation adjacency)
\item Gradient descent optimizes rule weights against example loss
\end{itemize}

This connects to Prologos through the propagator network:

\begin{itemize}
\item Each candidate clause becomes a propagator with a continuous weight
\item The weight lives in a propagator cell over a \texttt{\textbackslash{}[0,1\textbackslash{}]} lattice
\item Gradient information flows backward through the network (counter-propagation)
\item The ATMS tracks which clause combinations are consistent
\end{itemize}

\begin{verbatim}
;; Differentiable ILP as weighted clauses
learn-differentiable path
  from-data edge-triples
  metarules [chain identity inverse]
  optimizer :adam
  epochs 100
  ;; Each learned clause gets a weight:
  ;; rel path | [?x ?y] :- [edge ?x ?y]        ;; weight 0.95
  ;; rel path | [?x ?z] :- [edge ?x ?y] [path ?y ?z]  ;; weight 0.88
\end{verbatim}
\subsection{Composition with Propagator Networks}
\label{sec:orgfafff6b}

ILP as propagator computation:

\begin{enumerate}
\item \textbf{Hypothesis space as lattice}: The set of candidate programs, ordered by
generality (more general = higher). Learning descends from the most general
hypothesis.
\item \textbf{Example propagators}: Each positive/negative example is a propagator that
constrains the hypothesis space (positive: must cover; negative: must not cover).
\item \textbf{Metarule propagators}: Each metarule instantiation is a propagator that
adds a candidate clause to the hypothesis.
\item \textbf{Pruning propagators}: Constraint propagation eliminates inconsistent
hypothesis subspaces.
\end{enumerate}

The ATMS is particularly valuable here: each candidate clause is an assumption,
and nogoods track clause combinations that violate negative examples.
\subsection{Implementation Roadmap}
\label{sec:orgdf3a6c4}

\begin{enumerate}
\item Define \texttt{learn} top-level form and metarule syntax
\item Implement metarule-guided search as propagator network construction
\item Connect to ATMS for hypothesis tracking (clauses as assumptions)
\item Add differentiable ILP as a solver strategy (\texttt{:optimizer} config)
\item Bridge to the type system (typed MIL uses Prologos's type inference)
\end{enumerate}
\section{Probabilistic Logic Programming}
\label{sec:org77a6f8c}

\subsection{Background: ProbLog and the Distribution Semantics}
\label{sec:org3ef8905}

ProbLog (KU Leuven) extends Prolog with probabilistic facts:

\begin{verbatim}
0.3 :: burglary.
0.1 :: earthquake.
alarm :- burglary.
alarm :- earthquake.
\end{verbatim}

The \emph{distribution semantics}: each probabilistic fact independently true/false
with its stated probability. A ground query's probability is the sum over all
possible worlds where it is derivable, weighted by world probability.

Inference uses \emph{knowledge compilation}: the derivation structure is compiled to
a Boolean formula (SDD, BDD, or d-DNNF), then weighted model counting computes
the probability.
