docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.org
** Algebraic ProbLog and Semirings

Algebraic ProbLog (aProbLog) generalizes from probabilities to arbitrary
commutative semirings. A semiring =(S, +, x, 0, 1)= replaces:

| Semiring           | =+= (combine)  | =x= (chain)    | Meaning                    |
|--------------------+-----------------+-----------------+----------------------------|
| Probability        | =+=             | =x=             | Standard probabilistic LP  |
| Viterbi            | =max=           | =x=             | Most probable proof        |
| Tropical           | =min=           | =+=             | Shortest path              |
| Boolean            | =or=            | =and=           | Standard LP                |
| Fuzzy              | =max=           | =min=           | Fuzzy LP                   |
| Gradient           | =+=             | =x= + chain rule| Differentiable inference   |
| Access control     | =meet=          | =join=          | Security lattice LP        |

This is directly relevant to Prologos: /every semiring-based LP is a
propagator network with a specific lattice/.

** DeepProbLog: Neural Predicates

DeepProbLog (Manhaeve et al., 2018, with continued development through 2025)
extends ProbLog with /neural predicates/: predicates whose truth probability
is parameterized by a neural network.

#+begin_src prolog
nn(digit_net, [X], Y, [0..9]) :: digit(X, Y).
addition(X, Y, Z) :- digit(X, A), digit(Y, B), Z is A + B.
#+end_src

The neural network's output is a probability distribution over the predicate's
possible values. Learning jointly optimizes the neural network weights and the
logical program structure.

** DC-ProbLog: Continuous Distributions (2024)

DC-ProbLog (Zuidberghe et al., 2024) extends ProbLog to hybrid discrete-continuous
domains using /distributional clauses/. The key contribution is a /measure
semantics/ that generalizes the distribution semantics to continuous random
variables, along with an inference engine (IALW---infinitesimal algebraic
likelihood weighting) based on knowledge compilation.

** Proposed Prologos Syntax

#+begin_src prologos
;; Probabilistic facts (discrete)
0.3 :: burglary
0.1 :: earthquake

;; Weighted logic variable
defr diagnosis
  | [?symptom : Symbol] [?disease : Symbol ^?p]
  ;; ?p is the marginal probability of ?disease given ?symptom

;; Distributional clause (continuous)
defr sensor-reading
  | [?sensor : Symbol] [?value : Real ~ Normal ?mu ?sigma]

rel sensor-reading
  | [:thermometer ?v] :- [?v ~ Normal 20.0 2.0]
  | [:barometer ?v]   :- [?v ~ Normal 1013.0 5.0]

;; Query with probability
solve [diagnosis :fever ?d] :probabilistic
;; Returns: {d: :flu, p: 0.7}, {d: :cold, p: 0.25}, ...

;; Conditional probability
solve [alarm] given [earthquake] :probabilistic
#+end_src

** Semiring Framework as Propagator Lattice

The semiring-based framework maps directly to the propagator network:

- A /probability cell/ is a propagator cell over the semiring =(R+, +, x, 0, 1)=.
  The merge operation is semiring addition (combining evidence from multiple
  derivation paths).

- A /Viterbi cell/ uses =(R+, max, x, 0, 1)= for most-probable-explanation
  queries. Same propagator structure, different lattice.

- The /gradient semiring/ enables backpropagation through the logic program.
  Each cell stores both a value and its gradient. The merge operation combines
  values additively and gradients via the chain rule.

New propagator cell types needed:

| Cell Type        | Lattice                     | Merge           | Use Case                |
|------------------+-----------------------------+-----------------+-------------------------|
| =prob-cell=      | =[0,1]= with =+=            | Sum of proofs   | Marginal probability    |
| =viterbi-cell=   | =[0,1]= with =max=          | Best proof      | MAP inference           |
| =log-prob-cell=  | =(-inf,0]= with =logadd=    | Numerically stable | Large-scale inference |
| =gradient-cell=  | =R x R= (value, gradient)   | Sum + chain rule| Differentiable LP       |
| =interval-cell=  | Interval =[lo,hi]=          | Narrow          | Bounded probability     |
| =distribution-cell= | Measure space            | Mixture         | Continuous distributions|

** Knowledge Compilation and the ATMS

ProbLog's inference via knowledge compilation (SDDs, d-DNNF) has a natural
counterpart in the ATMS (=atms.rkt=):

- Each probabilistic fact is an /assumption/ in the ATMS
- Each derivation path is a /support set/ (conjunction of assumptions)
- The probability of a query is the weighted count over consistent support sets
- =atms-solve-all= already enumerates all consistent worldviews
- The probability computation is a post-processing step: sum over worldviews,
  weighted by product of assumption probabilities

This means probabilistic LP can be implemented as a thin layer over the
existing ATMS, without a separate knowledge compilation pipeline.

** Implementation Roadmap

1. Add probability annotations to facts (=0.3 :: fact=) in the parser
2. Implement =prob-cell= and =viterbi-cell= lattice types
3. Extend =atms-solve-all= with weighted enumeration
4. Add =:probabilistic= solver strategy in =solver-config=
5. Implement distributional clause syntax and continuous sampling
6. Bridge to the gradient semiring for DeepProbLog-style learning

* Category-Theoretic Foundations

** Why Category Theory Matters for Prologos

Prologos already uses categorical structures implicitly:

- Propagator cells form a /category of lattices/ with monotone maps as morphisms
- The ATMS manages a /fibered structure/ where each worldview is a fiber
- Well-founded semantics uses /approximation fixpoint theory/ (Denecker et al.),
  which is fundamentally about operators on bilattices
- Dependent types form a /locally cartesian closed category/
- Session types form a /category of processes/ with session type morphisms

Making these connections explicit enables principled extension and composition.

** Toposes as Generalized Logic

A topos is a category that behaves like a generalized universe of sets. Every
topos has an /internal logic/ that may be intuitionistic, classical, or
something more exotic. The subobject classifier =Omega= in a topos generalizes
the Boolean truth values ={true, false}= to an arbitrary Heyting algebra.

For Prologos:
- The standard Herbrand model is the topos =Set= (classical logic)
- Three-valued logic (well-founded semantics) corresponds to the topos
  =Set^{3}= or equivalently presheaves on the three-element chain
- Probabilistic logic corresponds to the /Giry monad/ on =Meas= (the category
  of measurable spaces)
- Fuzzy logic corresponds to sheaves valued in =[0,1]=

A topos-aware logic engine could parameterize over the choice of topos, enabling
the same syntax to express classical, intuitionistic, fuzzy, or probabilistic
reasoning by swapping the underlying topos.

#+begin_src prologos
;; Topos-parameterized relation
defr reachable {T : Topos}
  | [?x : Node] [?y : Node] [:via T]

;; Classical: standard LP
solve [reachable :a :b :via Classical]

;; Three-valued: well-founded semantics (already implemented!)
solve [reachable :a :b :via WellFounded]

;; Fuzzy: degree-of-truth in [0,1]
solve [reachable :a :b :via Fuzzy]
#+end_src

