docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
\subsection{Algebraic ProbLog and Semirings}
\label{sec:orgc61edfb}

Algebraic ProbLog (aProbLog) generalizes from probabilities to arbitrary
commutative semirings. A semiring \texttt{(S, +, x, 0, 1)} replaces:

\begin{center}
\begin{tabular}{llll}
Semiring & \texttt{+} (combine) & \texttt{x} (chain) & Meaning\\
\hline
Probability & \texttt{+} & \texttt{x} & Standard probabilistic LP\\
Viterbi & \texttt{max} & \texttt{x} & Most probable proof\\
Tropical & \texttt{min} & \texttt{+} & Shortest path\\
Boolean & \texttt{or} & \texttt{and} & Standard LP\\
Fuzzy & \texttt{max} & \texttt{min} & Fuzzy LP\\
Gradient & \texttt{+} & \texttt{x} + chain rule & Differentiable inference\\
Access control & \texttt{meet} & \texttt{join} & Security lattice LP\\
\end{tabular}
\end{center}

This is directly relevant to Prologos: \emph{every semiring-based LP is a
propagator network with a specific lattice}.
\subsection{DeepProbLog: Neural Predicates}
\label{sec:orgfaee791}

DeepProbLog (Manhaeve et al., 2018, with continued development through 2025)
extends ProbLog with \emph{neural predicates}: predicates whose truth probability
is parameterized by a neural network.

\begin{verbatim}
nn(digit_net, [X], Y, [0..9]) :: digit(X, Y).
addition(X, Y, Z) :- digit(X, A), digit(Y, B), Z is A + B.
\end{verbatim}

The neural network's output is a probability distribution over the predicate's
possible values. Learning jointly optimizes the neural network weights and the
logical program structure.
\subsection{DC-ProbLog: Continuous Distributions (2024)}
\label{sec:org5255144}

DC-ProbLog (Zuidberghe et al., 2024) extends ProbLog to hybrid discrete-continuous
domains using \emph{distributional clauses}. The key contribution is a \emph{measure
semantics} that generalizes the distribution semantics to continuous random
variables, along with an inference engine (IALW---infinitesimal algebraic
likelihood weighting) based on knowledge compilation.
\subsection{Proposed Prologos Syntax}
\label{sec:orgc82a71b}

\begin{verbatim}
;; Probabilistic facts (discrete)
0.3 :: burglary
0.1 :: earthquake

;; Weighted logic variable
defr diagnosis
  | [?symptom : Symbol] [?disease : Symbol ^?p]
  ;; ?p is the marginal probability of ?disease given ?symptom

;; Distributional clause (continuous)
defr sensor-reading
  | [?sensor : Symbol] [?value : Real ~ Normal ?mu ?sigma]

rel sensor-reading
  | [:thermometer ?v] :- [?v ~ Normal 20.0 2.0]
  | [:barometer ?v]   :- [?v ~ Normal 1013.0 5.0]

;; Query with probability
solve [diagnosis :fever ?d] :probabilistic
;; Returns: {d: :flu, p: 0.7}, {d: :cold, p: 0.25}, ...

;; Conditional probability
solve [alarm] given [earthquake] :probabilistic
\end{verbatim}
\subsection{Semiring Framework as Propagator Lattice}
\label{sec:org382697a}

The semiring-based framework maps directly to the propagator network:

\begin{itemize}
\item A \emph{probability cell} is a propagator cell over the semiring \texttt{(R+, +, x, 0, 1)}.
The merge operation is semiring addition (combining evidence from multiple
derivation paths).

\item A \emph{Viterbi cell} uses \texttt{(R+, max, x, 0, 1)} for most-probable-explanation
queries. Same propagator structure, different lattice.

\item The \emph{gradient semiring} enables backpropagation through the logic program.
Each cell stores both a value and its gradient. The merge operation combines
values additively and gradients via the chain rule.
\end{itemize}

New propagator cell types needed:

\begin{center}
\begin{tabular}{llll}
Cell Type & Lattice & Merge & Use Case\\
\hline
\texttt{prob-cell} & \texttt{[0,1]} with \texttt{+} & Sum of proofs & Marginal probability\\
\texttt{viterbi-cell} & \texttt{[0,1]} with \texttt{max} & Best proof & MAP inference\\
\texttt{log-prob-cell} & \texttt{(-inf,0]} with \texttt{logadd} & Numerically stable & Large-scale inference\\
\texttt{gradient-cell} & \texttt{R x R} (value, gradient) & Sum + chain rule & Differentiable LP\\
\texttt{interval-cell} & Interval \texttt{[lo,hi]} & Narrow & Bounded probability\\
\texttt{distribution-cell} & Measure space & Mixture & Continuous distributions\\
\end{tabular}
\end{center}
\subsection{Knowledge Compilation and the ATMS}
\label{sec:orgc93aa8e}

ProbLog's inference via knowledge compilation (SDDs, d-DNNF) has a natural
counterpart in the ATMS (\texttt{atms.rkt}):

\begin{itemize}
\item Each probabilistic fact is an \emph{assumption} in the ATMS
\item Each derivation path is a \emph{support set} (conjunction of assumptions)
\item The probability of a query is the weighted count over consistent support sets
\item \texttt{atms-solve-all} already enumerates all consistent worldviews
\item The probability computation is a post-processing step: sum over worldviews,
weighted by product of assumption probabilities
\end{itemize}

This means probabilistic LP can be implemented as a thin layer over the
existing ATMS, without a separate knowledge compilation pipeline.
\subsection{Implementation Roadmap}
\label{sec:org82258a4}

\begin{enumerate}
\item Add probability annotations to facts (\texttt{0.3 :: fact}) in the parser
\item Implement \texttt{prob-cell} and \texttt{viterbi-cell} lattice types
\item Extend \texttt{atms-solve-all} with weighted enumeration
\item Add \texttt{:probabilistic} solver strategy in \texttt{solver-config}
\item Implement distributional clause syntax and continuous sampling
\item Bridge to the gradient semiring for DeepProbLog-style learning
\end{enumerate}
\section{Category-Theoretic Foundations}
\label{sec:org3764850}

\subsection{Why Category Theory Matters for Prologos}
\label{sec:orga42d8b6}

Prologos already uses categorical structures implicitly:

\begin{itemize}
\item Propagator cells form a \emph{category of lattices} with monotone maps as morphisms
\item The ATMS manages a \emph{fibered structure} where each worldview is a fiber
\item Well-founded semantics uses \emph{approximation fixpoint theory} (Denecker et al.),
which is fundamentally about operators on bilattices
\item Dependent types form a \emph{locally cartesian closed category}
\item Session types form a \emph{category of processes} with session type morphisms
\end{itemize}

Making these connections explicit enables principled extension and composition.
\subsection{Toposes as Generalized Logic}
\label{sec:org597b17b}

A topos is a category that behaves like a generalized universe of sets. Every
topos has an \emph{internal logic} that may be intuitionistic, classical, or
something more exotic. The subobject classifier \texttt{Omega} in a topos generalizes
the Boolean truth values \texttt{\{true, false\}} to an arbitrary Heyting algebra.

For Prologos:
\begin{itemize}
\item The standard Herbrand model is the topos \texttt{Set} (classical logic)
\item Three-valued logic (well-founded semantics) corresponds to the topos
\texttt{Set\textasciicircum{}\{3\}} or equivalently presheaves on the three-element chain
\item Probabilistic logic corresponds to the \emph{Giry monad} on \texttt{Meas} (the category
of measurable spaces)
\item Fuzzy logic corresponds to sheaves valued in \texttt{[0,1]}
\end{itemize}

A topos-aware logic engine could parameterize over the choice of topos, enabling
the same syntax to express classical, intuitionistic, fuzzy, or probabilistic
reasoning by swapping the underlying topos.

\begin{verbatim}
;; Topos-parameterized relation
defr reachable {T : Topos}
  | [?x : Node] [?y : Node] [:via T]

;; Classical: standard LP
solve [reachable :a :b :via Classical]

;; Three-valued: well-founded semantics (already implemented!)
solve [reachable :a :b :via WellFounded]

;; Fuzzy: degree-of-truth in [0,1]
solve [reachable :a :b :via Fuzzy]
\end{verbatim}
