docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.org
** Sheaves for Contextual Reasoning

Sheaves generalize the idea of "data varying over a space" with /gluing
conditions/ that ensure local data can be consistently assembled into
global data. In programming language terms:

- A presheaf assigns data to each "context" (open set)
- A sheaf adds the condition that compatible local data determines unique global data
- The /sheaf condition/ is a coherence requirement

For Prologos, sheaves enable /contextual logic programming/:

#+begin_src prologos
;; Facts that vary by context (location, time, agent)
defr temperature
  | [?loc : Location] [?temp : Real] [:context ?ctx]

;; Sheaf condition: overlapping contexts must agree
;; If ctx1 and ctx2 overlap, temperature readings must be consistent

;; Query with context restriction
solve [temperature :kitchen ?t :context :morning]
#+end_src

The propagator network implements the sheaf gluing condition: consistency
propagators between overlapping contexts ensure the sheaf axiom holds.

** Kan Extensions for Program Transformation

Kan extensions formalize the notion of "best approximation" when changing
the domain of a functor. In programming:

- /Left Kan extension/ corresponds to existential quantification / colimit /
  "the best summary"
- /Right Kan extension/ corresponds to universal quantification / limit /
  "the best conservative approximation"

For Prologos, Kan extensions relate to:

1. *Abstract interpretation*: The abstraction function =alpha= is a left adjoint
   (left Kan extension), and the concretization =gamma= is a right adjoint.
   This is a Galois connection.

2. *Program optimization*: The continuation-passing-style transformation
   corresponds to the codensity monad, which arises from a right Kan extension.
   This connects to Prologos's narrowing infrastructure.

3. *Query optimization*: Magic set transformations (converting bottom-up
   evaluation to goal-directed) can be expressed as Kan extensions along
   the inclusion functor from relevant facts to all facts.

** Galois Connections for Abstract Interpretation

A Galois connection =<alpha, C, D, gamma>= between a concrete domain =C= and an
abstract domain =D= provides:

- =alpha: C -> D= (abstraction): maps concrete values to their best abstract approximation
- =gamma: D -> C= (concretization): maps abstract values to the concrete values they represent
- Soundness guarantee: =alpha . gamma <= id_D= and =id_C <= gamma . alpha=

In Prologos's propagator framework:

#+begin_src prologos
;; Abstract interpretation as cross-domain propagation
;; (already have net-add-cross-domain-propagator in propagator.rkt!)

;; Concrete domain: exact integer sets
;; Abstract domain: sign lattice {neg, zero, pos, top, bot}

;; The Galois connection is a pair of cross-domain propagators:
;; alpha: integer-set-cell -> sign-cell (abstraction propagator)
;; gamma: sign-cell -> integer-set-cell (concretization propagator)
#+end_src

The existing =net-add-cross-domain-propagator= in =propagator.rkt= is already
the infrastructure needed for Galois-connected abstract interpretation.

** Fibered Categories for Dependent Types + Logic

Prologos has both dependent types and logic programming. The categorical
framework that unifies these is /fibered category theory/ (Jacobs, 1999):

- A /fibration/ =p: E -> B= maps a "total" category =E= to a "base" category =B=
- Each object =b= in =B= has a /fiber/ =E_b= (the category of types/propositions
  depending on =b=)
- Reindexing along morphisms in =B= gives substitution
- The Curry-Howard-Lambek correspondence extends: types are objects in fibers,
  terms are morphisms, dependent types are fibered structures

For Prologos, this means:
- The type =<(x : Nat) -> Vec x A>= lives in a fiber over =Nat=
- A relational query =solve [vec-append ?xs ?ys ?zs]= where =?xs : Vec n A=
  is a morphism in the fiber over =n=
- Substitution of =n := 3= reindexes the fiber, specializing the query

** Institutions for Multi-Logic Reasoning

Institutions (Goguen and Burstall, 1992) formalize the notion of a "logical
system" abstractly, enabling reasoning across multiple logics:

- An institution =I = (Sig, Sen, Mod, |=)= specifies:
  - =Sig=: category of signatures
  - =Sen=: functor from signatures to sentences
  - =Mod=: functor from signatures to models (contravariant)
  - =|==: satisfaction relation (parameterized by signature)

For Prologos, institutions enable multi-logic queries:

#+begin_src prologos
;; A query that mixes classical and well-founded reasoning
solve
  [parent :alice ?x]                    ;; classical LP
  :and
  (wf [reachable ?x :goal])            ;; well-founded semantics
  :and
  (prob [risky ?x] > 0.5)              ;; probabilistic LP
#+end_src

Each sub-query runs in its own "institution" (logic), and the institution
morphisms (signature translations) ensure consistency across the boundary.
The propagator network is the /universal medium/: each institution maps to
a specific lattice/propagator configuration, and cross-domain propagators
implement the institution morphisms.

** Implementation Roadmap

1. Make lattice descriptors (=lattice-desc=) a first-class abstraction
   parameterizable by topos choice
2. Implement sheaf gluing as consistency propagators
3. Express abstract interpretation via cross-domain propagators + Galois connections
4. Document the fibered structure of dependent types + relational sublanguage
5. Design institution-aware multi-logic solver dispatch

* Novel Directions

** Linear Logic Programming

Prologos already has QTT (Quantitative Type Theory) tracking resource usage
via multiplicities (=m0=, =m1=, =mw=). Extending this to the relational
sublanguage enables /linear logic programming/ where facts are /consumed/
by derivation.

#+begin_src prologos
;; Linear fact: consumed when used
defr has-item {1}  ;; multiplicity 1 = linear
  | [?agent : Agent] [?item : Item]

;; Using a linear fact consumes it
rel craft
  | [?agent :sword] :- {1} [has-item ?agent :iron]
                        {1} [has-item ?agent :wood]
  ;; After this derivation, agent no longer has iron or wood

;; Unrestricted fact: can be used any number of times
defr knows {w}
  | [?agent : Agent] [?recipe : Recipe]
#+end_src

The propagator network needs a new cell type for linear resources: a
/counting cell/ where the merge operation is addition (resource
accumulation) and consumption is subtraction (resource use). The lattice
is =Z= (integers) with a "non-negative" invariant.

Recent work (2024) on deadlock-free separation logic and the Linear Session
Abstract Machine (SAM) shows how linear logic, session types, and concurrency
compose, which is directly relevant to Prologos's session type system.

