docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
\subsection{Sheaves for Contextual Reasoning}
\label{sec:org130c981}

Sheaves generalize the idea of "data varying over a space" with \emph{gluing
conditions} that ensure local data can be consistently assembled into
global data. In programming language terms:

\begin{itemize}
\item A presheaf assigns data to each "context" (open set)
\item A sheaf adds the condition that compatible local data determines unique global data
\item The \emph{sheaf condition} is a coherence requirement
\end{itemize}

For Prologos, sheaves enable \emph{contextual logic programming}:

\begin{verbatim}
;; Facts that vary by context (location, time, agent)
defr temperature
  | [?loc : Location] [?temp : Real] [:context ?ctx]

;; Sheaf condition: overlapping contexts must agree
;; If ctx1 and ctx2 overlap, temperature readings must be consistent

;; Query with context restriction
solve [temperature :kitchen ?t :context :morning]
\end{verbatim}

The propagator network implements the sheaf gluing condition: consistency
propagators between overlapping contexts ensure the sheaf axiom holds.
\subsection{Kan Extensions for Program Transformation}
\label{sec:org741d267}

Kan extensions formalize the notion of "best approximation" when changing
the domain of a functor. In programming:

\begin{itemize}
\item \emph{Left Kan extension} corresponds to existential quantification / colimit /
"the best summary"
\item \emph{Right Kan extension} corresponds to universal quantification / limit /
"the best conservative approximation"
\end{itemize}

For Prologos, Kan extensions relate to:

\begin{enumerate}
\item \textbf{Abstract interpretation}: The abstraction function \texttt{alpha} is a left adjoint
(left Kan extension), and the concretization \texttt{gamma} is a right adjoint.
This is a Galois connection.

\item \textbf{Program optimization}: The continuation-passing-style transformation
corresponds to the codensity monad, which arises from a right Kan extension.
This connects to Prologos's narrowing infrastructure.

\item \textbf{Query optimization}: Magic set transformations (converting bottom-up
evaluation to goal-directed) can be expressed as Kan extensions along
the inclusion functor from relevant facts to all facts.
\end{enumerate}
\subsection{Galois Connections for Abstract Interpretation}
\label{sec:org058130a}

A Galois connection \texttt{<alpha, C, D, gamma>} between a concrete domain \texttt{C} and an
abstract domain \texttt{D} provides:

\begin{itemize}
\item \texttt{alpha: C -> D} (abstraction): maps concrete values to their best abstract approximation
\item \texttt{gamma: D -> C} (concretization): maps abstract values to the concrete values they represent
\item Soundness guarantee: \texttt{alpha . gamma <} id\textsubscript{D}= and \texttt{id\_C <} gamma . alpha=
\end{itemize}

In Prologos's propagator framework:

\begin{verbatim}
;; Abstract interpretation as cross-domain propagation
;; (already have net-add-cross-domain-propagator in propagator.rkt!)

;; Concrete domain: exact integer sets
;; Abstract domain: sign lattice {neg, zero, pos, top, bot}

;; The Galois connection is a pair of cross-domain propagators:
;; alpha: integer-set-cell -> sign-cell (abstraction propagator)
;; gamma: sign-cell -> integer-set-cell (concretization propagator)
\end{verbatim}

The existing \texttt{net-add-cross-domain-propagator} in \texttt{propagator.rkt} is already
the infrastructure needed for Galois-connected abstract interpretation.
\subsection{Fibered Categories for Dependent Types + Logic}
\label{sec:org91f88e2}

Prologos has both dependent types and logic programming. The categorical
framework that unifies these is \emph{fibered category theory} (Jacobs, 1999):

\begin{itemize}
\item A \emph{fibration} \texttt{p: E -> B} maps a "total" category \texttt{E} to a "base" category \texttt{B}
\item Each object \texttt{b} in \texttt{B} has a \emph{fiber} \texttt{E\_b} (the category of types/propositions
depending on \texttt{b})
\item Reindexing along morphisms in \texttt{B} gives substitution
\item The Curry-Howard-Lambek correspondence extends: types are objects in fibers,
terms are morphisms, dependent types are fibered structures
\end{itemize}

For Prologos, this means:
\begin{itemize}
\item The type \texttt{<(x : Nat) -> Vec x A>} lives in a fiber over \texttt{Nat}
\item A relational query \texttt{solve [vec-append ?xs ?ys ?zs]} where \texttt{?xs : Vec n A}
is a morphism in the fiber over \texttt{n}
\item Substitution of \texttt{n :} 3= reindexes the fiber, specializing the query
\end{itemize}
\subsection{Institutions for Multi-Logic Reasoning}
\label{sec:org92903c2}

Institutions (Goguen and Burstall, 1992) formalize the notion of a "logical
system" abstractly, enabling reasoning across multiple logics:

\begin{itemize}
\item An institution \texttt{I = (Sig, Sen, Mod, |})= specifies:
\begin{itemize}
\item \texttt{Sig}: category of signatures
\item \texttt{Sen}: functor from signatures to sentences
\item \texttt{Mod}: functor from signatures to models (contravariant)
\item \texttt{|=}: satisfaction relation (parameterized by signature)
\end{itemize}
\end{itemize}

For Prologos, institutions enable multi-logic queries:

\begin{verbatim}
;; A query that mixes classical and well-founded reasoning
solve
  [parent :alice ?x]                    ;; classical LP
  :and
  (wf [reachable ?x :goal])            ;; well-founded semantics
  :and
  (prob [risky ?x] > 0.5)              ;; probabilistic LP
\end{verbatim}

Each sub-query runs in its own "institution" (logic), and the institution
morphisms (signature translations) ensure consistency across the boundary.
The propagator network is the \emph{universal medium}: each institution maps to
a specific lattice/propagator configuration, and cross-domain propagators
implement the institution morphisms.
\subsection{Implementation Roadmap}
\label{sec:orga829ec4}

\begin{enumerate}
\item Make lattice descriptors (\texttt{lattice-desc}) a first-class abstraction
parameterizable by topos choice
\item Implement sheaf gluing as consistency propagators
\item Express abstract interpretation via cross-domain propagators + Galois connections
\item Document the fibered structure of dependent types + relational sublanguage
\item Design institution-aware multi-logic solver dispatch
\end{enumerate}
\section{Novel Directions}
\label{sec:orgfdbb8f3}

\subsection{Linear Logic Programming}
\label{sec:org49d0c8e}

Prologos already has QTT (Quantitative Type Theory) tracking resource usage
via multiplicities (\texttt{m0}, \texttt{m1}, \texttt{mw}). Extending this to the relational
sublanguage enables \emph{linear logic programming} where facts are \emph{consumed}
by derivation.

\begin{verbatim}
;; Linear fact: consumed when used
defr has-item {1}  ;; multiplicity 1 = linear
  | [?agent : Agent] [?item : Item]

;; Using a linear fact consumes it
rel craft
  | [?agent :sword] :- {1} [has-item ?agent :iron]
                        {1} [has-item ?agent :wood]
  ;; After this derivation, agent no longer has iron or wood

;; Unrestricted fact: can be used any number of times
defr knows {w}
  | [?agent : Agent] [?recipe : Recipe]
\end{verbatim}

The propagator network needs a new cell type for linear resources: a
\emph{counting cell} where the merge operation is addition (resource
accumulation) and consumption is subtraction (resource use). The lattice
is \texttt{Z} (integers) with a "non-negative" invariant.

Recent work (2024) on deadlock-free separation logic and the Linear Session
Abstract Machine (SAM) shows how linear logic, session types, and concurrency
compose, which is directly relevant to Prologos's session type system.
