docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.org
** Temporal Logic Programming

Express LTL (Linear Temporal Logic) and CTL (Computation Tree Logic)
properties as relational queries.

#+begin_src prologos
;; Temporal operators as relational combinators
defr eventually
  | [?prop : Prop] [?trace : Trace]

rel eventually
  | [?p ?t] :- [holds ?p [head ?t]]
  | [?p ?t] :- [eventually ?p [tail ?t]]

defr always
  | [?prop : Prop] [?trace : Trace]

:coinductive  ;; Greatest fixpoint!
rel always
  | [?p ?t] :- [holds ?p [head ?t]] [always ?p [tail ?t]]

;; CTL: exists-path and forall-path over branching traces
defr exists-eventually
  | [?prop : Prop] [?state : State]

rel exists-eventually
  | [?p ?s] :- [holds ?p ?s]
  | [?p ?s] :- [transition ?s ?s'] [exists-eventually ?p ?s']
#+end_src

Note that =always= is naturally coinductive (gfp), while =eventually= is
inductive (lfp). The bilattice infrastructure handles both directions
simultaneously.

Temporal LP composes with the propagator network through /trace cells/:
a cell whose lattice is a prefix ordering on execution traces. The
=run-to-quiescence= scheduler already handles iterative fixpoints over
such lattices.

** Epistemic Logic Programming

Knowledge and belief operators for multi-agent reasoning:

#+begin_src prologos
;; Epistemic operators
defr knows
  | [?agent : Agent] [?prop : Prop]

defr believes
  | [?agent : Agent] [?prop : Prop]

;; Common knowledge
defr common-knowledge
  | [?group : List Agent] [?prop : Prop]

;; Epistemic rules
rel knows
  | [:alice [safe ?code]] :- [observed :alice ?code]
  | [?a ?p]               :- [told ?a ?p ?source] [trusts ?a ?source]

;; Negative introspection: if alice doesn't know p, she knows she doesn't
rel knows
  | [?a [not-known ?p]] :- (not [knows ?a ?p])
#+end_src

Each agent's knowledge state maps to a separate /worldview/ in the ATMS.
The ATMS assumption sets model possible worlds: agent =A= knows =P= iff
=P= holds in all worldviews consistent with =A='s observations.

** Abductive Logic Programming

Abduction explains observations by hypothesizing causes:

#+begin_src prologos
;; Abducible predicates (can be hypothesized)
:abducible
defr broken | [?component : Component]

:abducible
defr leak | [?pipe : Pipe]

;; Rules connecting causes to effects
rel alarm
  | [] :- [broken :sensor]
  | [] :- [leak :main-pipe] [not [valve-closed :main]]

;; Abductive query: what explains the observation?
abduce [alarm]
;; Returns: {broken :sensor} OR {leak :main-pipe, not valve-closed :main}
#+end_src

The ATMS is the natural implementation vehicle: each abducible fact becomes
an assumption. =atms-solve-all= enumerates minimal consistent explanations.
The =atms-minimal-diagnoses= function already implements GDE-2 style
minimal diagnosis computation, which is precisely abductive reasoning.

** Answer Set Programming (ASP) Integration

ASP extends LP with stable model semantics, choice rules, and aggregates:

#+begin_src prologos
;; Choice rule: non-deterministically include/exclude
choice [color ?node ?c] :- [node ?node] [c in '[:red :green :blue]]

;; Integrity constraint: no two adjacent nodes same color
:- [edge ?n1 ?n2] [color ?n1 ?c] [color ?n2 ?c]

;; Aggregate
defr total-cost | [?cost : Nat]
rel total-cost
  | [?total] :- [?total = #sum { ?c : [task ?t] [cost ?t ?c] }]
#+end_src

ASP's stable models correspond to the ATMS's consistent worldviews:
- Each choice rule creates an =atms-amb= (mutually exclusive assumptions)
- Integrity constraints become =atms-add-nogood= (forbidden assumption sets)
- =atms-solve-all= enumerates stable models

The connection between ASP and CHR has been established (Abdennadher et al.,
2021): first-order ASP programs can be compiled to CHR programs, eliminating
the grounding phase.

** Constraint Handling Rules (CHR)

CHR is a committed-choice rule language for implementing constraint solvers:

#+begin_src prologos
;; CHR rules for a simple constraint solver
;; Simplification: replace constraint with simpler one
chr leq-reflexive
  | [leq ?x ?x] <=> :true

;; Propagation: add new constraint without removing old
chr leq-transitive
  | [leq ?x ?y] [leq ?y ?z] ==> [leq ?x ?z]

;; Simpagation: some kept, some removed
chr leq-antisymmetric
  | [leq ?x ?y] \ [leq ?y ?x] <=> [?x = ?y]
#+end_src

CHR maps directly to propagator networks:
- Each constraint is a propagator cell
- Simplification rules are propagators that replace cell values
- Propagation rules add new cells and propagators
- The CHR store is the propagator network state

Recent work on Quantified CHR (QCHR, 2025) extends CHR with dynamic
quantifier generation, which could interact with Prologos's dependent
types.

** Advanced Tabling: Beyond SLG

Prologos has SLG-style tabling (=tabling.rkt=). Extensions to explore:

*** Subsumptive Tabling

Standard variant tabling memoizes exact call patterns. Subsumptive tabling
recognizes that a more general call subsumes a more specific one:

#+begin_src prologos
;; With subsumptive tabling:
;; solve [ancestor :alice ?x] produces answers for all descendants
;; solve [ancestor :alice :carol] can reuse the table entry
;; (because ancestor(:alice, ?x) subsumes ancestor(:alice, :carol))
#+end_src

*** Mode-Directed Tabling

Combine modes with tabling to control which answers are kept:

#+begin_src prologos
;; Keep only the minimum-cost path (mode-directed)
:- table shortest_path(+, +, min)
defr shortest-path
  | [+from : Node] [+to : Node] [-cost : Nat :aggregate min]
#+end_src

*** Magic Sets

Transform bottom-up evaluation to be goal-directed (top-down efficiency
with bottom-up termination guarantees). This is particularly relevant for
Datalog-style reasoning within Prologos.

** Implementation Priority Matrix

| Extension           | Infrastructure Reuse | New Lattices | New Syntax | Complexity |
|---------------------+---------------------+--------------+------------+------------|
| Linear LP           | QTT multiplicities  | Counting     | Moderate   | Medium     |
| Temporal LP         | Bilattice (co/ind)  | Trace prefix | Moderate   | Medium     |
| Epistemic LP        | ATMS worldviews     | None         | Light      | Low        |
| Abductive LP        | ATMS diagnoses      | None         | Light      | Low        |
| ASP integration     | ATMS (amb, nogood)  | None         | Moderate   | Medium     |
| CHR                 | Propagator network  | None         | Heavy      | High       |
| Subsumptive tabling | tabling.rkt         | None         | None       | Medium     |
| Mode-directed tab.  | tabling.rkt + modes | Aggregate    | Light      | Medium     |
| Magic sets          | tabling.rkt         | None         | None       | High       |

* The Frontier: Modern LP Redesign (2020--2026)

** Survey of Recent Systems

*** Flix (Aarhus/Waterloo, 2016--2025)

Flix extends Datalog with arbitrary lattices and monotone functions, integrated
as a full programming language. Key innovations:

- /Lattice semantics/: Datalog relations can map to lattice values, not just sets
  of tuples. Computation proceeds to the least fixpoint over the lattice.
- /First-class Datalog programs/: Functions can take and return Datalog programs
  as values (rho abstraction), enabling modular analysis composition.
- /Type classes/: Flix uses type classes for lattice operations, paralleling
  Prologos's trait system.
- /Stratified negation + lattice fixpoints/: Combines standard Datalog negation
  with lattice-valued computation.

Relevance to Prologos: Flix demonstrates that lattice-parameterized fixpoint
computation (exactly what Prologos's propagator network does) is a viable
foundation for a full language. Prologos goes further by adding backtracking
search, ATMS, and well-founded semantics.

