docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
\subsubsection{Formulog (Harvard, 2020--2024)}
\label{sec:orgc25c6a7}

Formulog = Datalog + SMT + ML-like functions. Key innovations:

\begin{itemize}
\item \emph{SMT integration}: Datalog rules can contain SMT constraints; the solver
dispatches to Z3/CVC5 for satisfiability checking.
\item \emph{Eager evaluation}: A 2024 paper (Bembenek et al., OOPSLA 2024) shows that
DFS-style eager evaluation achieves 5--8x speedups over Soufflé-style
semi-naive evaluation for SMT-heavy workloads.
\item \emph{Algebraic data types}: First-class ADTs in Datalog, enabling analysis of
languages with recursive data.
\end{itemize}

Relevance to Prologos: Formulog's SMT integration could be modeled as an
external constraint domain (like CLP(SMT)). The eager evaluation strategy
is interesting for Prologos's solver, which already uses DFS.
\subsubsection{Ascent (2022--2024)}
\label{sec:org98d8425}

Ascent embeds Datalog in Rust via macros, with:
\begin{itemize}
\item Semi-naive evaluation compiled to Rust
\item Lattice support (similar to Flix)
\item Incremental computation
\end{itemize}
\subsubsection{Crepe (2021--2024)}
\label{sec:org984b4f0}

Crepe provides Datalog as a Rust procedural macro:
\begin{itemize}
\item Semi-naive evaluation with stratified negation
\item Seamless Rust interop
\item Compile-time Datalog analysis
\end{itemize}
\subsubsection{Flan (Purdue, POPL 2024)}
\label{sec:org563e20a}

Flan embeds Datalog in Scala via multi-stage programming:
\begin{itemize}
\item Combines Flix's flexibility with Soufflé's performance
\item Arbitrary aggregates, user-defined functions, lattices
\item Seamless host language integration
\end{itemize}
\subsubsection{Soufflé (2016--2025)}
\label{sec:org6072e13}

High-performance Datalog compiler:
\begin{itemize}
\item Compiles to parallel C++
\item Used in production for program analysis (Java points-to, security)
\item Subsumptive tabling, aggregates, ADTs
\end{itemize}
\subsection{What These Systems Teach Us}
\label{sec:org6df367c}

\begin{center}
\begin{tabular}{lllllll}
Capability & Classic Prolog & Flix & Formulog & Soufflé & Prologos (current) & Prologos (proposed)\\
\hline
Backtracking search & Yes & No & No & No & Yes & Yes\\
Lattice values & No & Yes & No & Partial & Yes (propagator) & Yes\\
SMT integration & No & No & Yes & No & No & Via CLP(SMT)\\
Dependent types & No & No & No & No & Yes & Yes\\
Session types & No & No & No & No & Yes & Yes\\
Linear types (QTT) & No & No & No & No & Yes & Yes\\
Well-founded semantics & XSB & No & No & No & Yes (bilattice) & Yes\\
ATMS/TMS & No & No & No & No & Yes & Yes\\
Probabilistic & ProbLog ext. & No & No & No & No & Yes (semiring)\\
Coinductive & CoLP ext. & No & No & No & No & Yes (bilattice)\\
Modes & Mercury ext. & No & No & No & No & Yes\\
ILP & Metagol ext. & No & No & No & No & Yes (ATMS)\\
Incremental & No & No & No & Partial & No & Via propagators\\
\end{tabular}
\end{center}

The table reveals Prologos's unique position: it is the only system that
combines backtracking search with lattice-based propagators, dependent types,
and ATMS-based assumption management. The proposed extensions would make it
the most expressive logic programming system in existence.
\subsection{The Propagator Network as Universal Substrate}
\label{sec:orgcdaf224}

The central thesis of this document: \emph{every extension of logic programming
maps to a specific configuration of the propagator network}.

\begin{center}
\begin{tabular}{ll}
LP Extension & Propagator Configuration\\
\hline
Standard LP & Boolean cells, unification propagators, DFS scheduler\\
CLP(FD) & Domain cells, arc-consistency propagators\\
Well-founded LP & Bilattice cells, alternating fixpoint scheduler\\
Probabilistic LP & Probability cells (semiring), knowledge compilation via ATMS\\
Coinductive LP & Descending cells (gfp), coinductive hypothesis propagators\\
ASP & ATMS assumptions as choices, nogoods as integrity constraints\\
Abductive LP & ATMS assumptions as abducibles, minimal diagnosis\\
Fuzzy LP & \texttt{[0,1]} cells, fuzzy connective propagators\\
Temporal LP & Trace-prefix cells, unfolding propagators\\
Linear LP & Counting cells, resource-consumption propagators\\
Abstract interp. & Galois-connected cross-domain propagators\\
Datalog/Flix-style & Lattice cells, semi-naive evaluation as propagation strategy\\
\end{tabular}
\end{center}

This is not a coincidence. The Radul-Sussman propagator model is a
\emph{generalization} of constraint propagation, which itself generalizes all of
the above. Prologos's architecture makes this explicit and exploitable.
\section{Composition Map}
\label{sec:orgd8adb2c}

How do these extensions compose with each other and with existing Prologos features?
\subsection{Pairwise Composition Matrix}
\label{sec:org03fda05}

\begin{center}
\begin{tabular}{llllllll}
 & Modes & Domains & Coinduction & ILP & Probabilistic & Category & Linear\\
\hline
\textbf{Modes} & --- & Strong & Moderate & Weak & Moderate & Strong & Strong\\
\textbf{Domains} &  & --- & Weak & Weak & Strong & Strong & Moderate\\
\textbf{Coinduction} &  &  & --- & Weak & Moderate & Strong & Moderate\\
\textbf{ILP} &  &  &  & --- & Strong & Weak & Weak\\
\textbf{Probabilistic} &  &  &  &  & --- & Strong & Moderate\\
\textbf{Category} &  &  &  &  &  & --- & Strong\\
\textbf{Linear} &  &  &  &  &  &  & ---\\
\end{tabular}
\end{center}

Legend: Strong = natural synergy, Moderate = composable with some work, Weak = mostly independent.
\subsection{Key Composition Synergies}
\label{sec:org3505d37}

\subsubsection{Modes + Domains (Strong)}
\label{sec:org2ab4411}

Mode analysis determines propagation direction; domain constraints determine
what propagates. Together: mode \texttt{(+)} on a domain variable means the domain
is fully known at entry; mode \texttt{(-)} means the domain must be computed.
This enables the constraint solver to select arc-consistency (for \texttt{?} mode)
vs. direct evaluation (for \texttt{+} mode).
\subsubsection{Probabilistic + Domains (Strong)}
\label{sec:orga1a9090}

CLP(FD) with probabilities = probabilistic constraint satisfaction. The
probability cell tracks the probability of each domain value, enabling
marginal inference over constrained variables. DC-ProbLog already combines
distributional clauses with constraint domains.
\subsubsection{Probabilistic + ILP (Strong)}
\label{sec:org4de463e}

Learning probabilistic logic programs. ProbLog + ILP = structure learning
for probabilistic models. The ATMS tracks assumption probabilities, and
the gradient semiring enables differentiable structure learning.
\subsubsection{Coinduction + Category Theory (Strong)}
\label{sec:org4ea9560}

Coinductive types are terminal coalgebras; coinductive LP computes greatest
fixpoints. The categorical framework provides the theory (final coalgebra
semantics), and coinductive LP provides the computation. Together: coinductive
reasoning about infinite structures with categorical guarantees.
\subsubsection{Modes + Linear Types (Strong)}
\label{sec:org8308b13}

Mode analysis tells you which arguments are consumed (\texttt{+} in linear context)
and which are produced (\texttt{-}). This determines the resource flow. QTT
multiplicities (\texttt{m0}, \texttt{m1}, \texttt{mw}) already track this at the type level;
modes extend it to the relational level.
\subsubsection{Category Theory + Probabilistic (Strong)}
\label{sec:org7fe1b8a}

The Giry monad provides the categorical foundation for probabilistic
programming. Semiring-based LP is a functor from the category of semirings
to the category of LP semantics. The propagator network is the \emph{universal
construction} that internalizes this functor.
