docs/research/2026-03-16_NEXT_GEN_LOGIC_PROGRAMMING.tex
\subsection{Composition with Existing Prologos Features}
\label{sec:orgb401b32}

\subsubsection{With Dependent Types}
\label{sec:org52548e7}

Every extension must respect the type system. Modes become \emph{type-level mode
annotations}. Domain constraints become \emph{refinement types}. Probabilities
become \emph{graded modalities}. The fibered category framework ensures coherence.
\subsubsection{With Session Types}
\label{sec:orgda63157}

Session types are coinductive protocols. Probabilistic session types (Das \&
Pfenning, 2023) track expected resource usage. Linear session types ensure
protocol adherence. Modes on session types determine whether a channel is
for sending (\texttt{+}) or receiving (\texttt{-}).
\subsubsection{With the Propagator Network}
\label{sec:org9c64dad}

All extensions are \emph{propagator network configurations}. The network is the
universal substrate. New extensions add:
\begin{itemize}
\item New cell types (domain cells, probability cells, trace cells, counting cells)
\item New propagator types (arc-consistency, gradient, coinductive hypothesis)
\item New scheduler strategies (semi-naive, alternating fixpoint, belief propagation)
\item New lattice descriptors (semirings, interval lattices, bilattices)
\end{itemize}
\subsubsection{With the ATMS}
\label{sec:org692254c}

The ATMS is the universal \emph{assumption management} layer:
\begin{itemize}
\item Probabilistic LP: assumptions with probabilities
\item Abductive LP: assumptions as abducibles
\item ASP: assumptions as choices, nogoods as constraints
\item ILP: assumptions as candidate clauses
\item Epistemic LP: assumptions as agent observations
\end{itemize}
\section{Research References}
\label{sec:org82d6bf7}

\subsection{Mode Analysis and Optimization}
\label{sec:org44566d9}
\begin{itemize}
\item Somogyi, Henderson, Conway. "The Execution Algorithm of Mercury." JLP, 1996.
\item Overton, Somogyi, Stuckey. "Constraint-Based Mode Analysis of Mercury." PPDP, 2002.
\item Hermenegildo et al. "An Overview of the Ciao Multiparadigm Language and Program Development Environment." ICLP, 2012.
\item Stade et al. "A Practical Approach for Testing Static Analysis Truths." 2025.
\end{itemize}
\subsection{Coinductive Logic Programming}
\label{sec:org55ec01a}
\begin{itemize}
\item Simon, Mallya, Bansal, Gupta. "Coinductive Logic Programming." ICLP, 2006.
\item Gupta, Bansal, Simon. "Coinductive Logic Programming and Its Applications." ICLP, 2007.
\item Ancona, Barbieri, Zucca. "Flexible Coinductive Logic Programming." TPLP, 2020.
\item Ancona, Barbieri, Zucca. "Checking Equivalence of Corecursive Streams." 2024.
\end{itemize}
\subsection{Probabilistic Logic Programming}
\label{sec:org01f4a4e}
\begin{itemize}
\item De Raedt, Kimmig, Toivonen. "ProbLog: A Probabilistic Prolog." UAI, 2007.
\item Manhaeve, Dumancic, Kimmig, Demeester, De Raedt. "DeepProbLog: Neural Probabilistic Logic Programming." NeurIPS, 2018.
\item Derkinderen, Manhaeve et al. "The DeepLog Neurosymbolic Machine." 2025.
\item Zuidberghe et al. "Declarative Probabilistic Logic Programming in Discrete-Continuous Domains." AIJ, 2024.
\item "Semirings for Probabilistic and Neuro-Symbolic Logic Programming." 2024.
\end{itemize}
\subsection{Inductive Logic Programming}
\label{sec:orgf1f89b5}
\begin{itemize}
\item Muggleton, Lin. "Meta-interpretive Learning of Higher-Order Dyadic Datalog." MLJ, 2014.
\item Cropper, Morel. "Learning Programs by Learning from Failures" (Popper). MLJ, 2020.
\item Cropper, Dumancic, Evans, Muggleton. "Inductive Logic Programming at 30." MLJ, 2021.
\item Morel, Cropper. "Typed Meta-interpretive Learning of Logic Programs." ILP, 2019.
\item "Meta-Interpretive Learning with Reuse." Mathematics, 2024.
\item "GLIDR: Graph-Like Inductive Logic Programming with Differentiable Reasoning." 2025.
\item Rocha et al. "Program Synthesis Using ILP for the ARC." 2025.
\item "Bridging Logic Programming and Deep Learning for Explainability through ILASP." 2025.
\end{itemize}
\subsection{Category Theory and Logic}
\label{sec:orgb54bec3}
\begin{itemize}
\item Jacobs. "Categorical Logic and Type Theory." Elsevier, 1999.
\item Goguen, Burstall. "Institutions: Abstract Model Theory for Specification and Programming." JACM, 1992.
\item Hinze. "Kan Extensions for Program Optimisation." MPC, 2012.
\item "Category-Theoretical and Topos-Theoretical Frameworks in Machine Learning: A Survey." Axioms, 2025.
\item Shiebler. "Kan Extensions in Data Science and Machine Learning." 2022.
\end{itemize}
\subsection{Well-Founded Semantics and Bilattices}
\label{sec:org3809080}
\begin{itemize}
\item Fitting. "Bilattices and the Semantics of Logic Programming." FACS, 1991.
\item Van Gelder, Ross, Schlipf. "The Well-Founded Semantics for General Logic Programs." JACM, 1991.
\item Denecker, Marek, Truszczynski. "Approximation Fixpoint Theory." 2004.
\item Charalambidis et al. "The Stable Model Semantics for Higher-Order Logic Programming." 2024.
\end{itemize}
\subsection{Modern Datalog Systems}
\label{sec:orgcf0b7b3}
\begin{itemize}
\item Madsen, Yee, Lhotak. "From Datalog to Flix." PLDI, 2016.
\item Bembenek, Greenberg, Chong. "Formulog: Datalog for SMT-Based Static Analysis." OOPSLA, 2020.
\item Bembenek, Greenberg, Chong. "Making Formulog Fast." OOPSLA, 2024.
\item "Flix: A Design for Language-Integrated Datalog." PACMPL, 2025.
\item Abeysinghe et al. "Flan: An Expressive and Efficient Datalog Compiler." POPL, 2024.
\end{itemize}
\subsection{Linear Logic and Session Types}
\label{sec:orgdf65c8a}
\begin{itemize}
\item Caires, Pfenning. "Session Types as Intuitionistic Linear Propositions." CONCUR, 2010.
\item "Comparing Session Type Systems Derived from Linear Logic." 2024.
\item "The Linear Session Abstract Machine." 2024.
\item Das, Pfenning. "Probabilistic Resource-Aware Session Types." POPL, 2023.
\item "Deadlock-Free Separation Logic: Linearity Yields Progress." POPL, 2024.
\item Derakhshan, Pfenning. "Rast: Resource-Aware Session Types with Arithmetic Refinements." FSCD, 2020.
\end{itemize}
\subsection{ASP and CHR}
\label{sec:org706bbdc}
\begin{itemize}
\item Abdennadher et al. "First-Order ASP Programs as CHR Programs." SAC, 2021.
\item "Quantified Constraint Handling Rules." TOCL, 2025.
\end{itemize}
\subsection{Abductive Logic Programming}
\label{sec:org46f76ee}
\begin{itemize}
\item "An Efficient Propositional System for Abductive Logic Programming." AI Review, 2024.
\end{itemize}
\subsection{Tabling}
\label{sec:orgccec5d4}
\begin{itemize}
\item Swift, Warren. "XSB: Extending Prolog with Tabled Logic Programming." TPLP, 2012.
\item Warren. "Programming in Tabled Prolog." Draft, 2023.
\end{itemize}
\section{Appendix: Lattice Requirements per Extension}
\label{sec:org937b7d0}

\begin{center}
\begin{tabular}{lllll}
Extension & Cell Lattice & Direction & Merge & Needs New \texttt{lattice-desc}?\\
\hline
Standard LP & Boolean & Ascending & Disjunction & No (\texttt{bool-lattice})\\
WFS & Boolean bilattice & Both & Join/Meet & No (\texttt{bilattice-var})\\
CLP(FD) & Reverse powerset & Descending & Intersection & Yes\\
CLP(Bounds) & Interval & Descending & Narrow & Yes\\
Probabilistic & \texttt{[0,1]} semiring & Ascending & Addition & Yes\\
Viterbi & \texttt{[0,1]} max-semiring & Ascending & Max & Yes\\
Fuzzy & \texttt{[0,1]} Heyting & Ascending & Max & Yes\\
Coinductive & Boolean & Descending & Conjunction & No (reuse \texttt{bool-lattice})\\
Linear resource & \texttt{Z} (integers) & Ascending & Addition & Yes\\
Trace prefix & Prefix order & Ascending & Common prefix & Yes\\
Sign abstract & Sign lattice & Ascending & Join & Yes\\
Set interval & Pair of sets & Both & Narrow bounds & Yes\\
\end{tabular}
\end{center}
\section{Appendix: Implementation Priority}
\label{sec:orgfbb5f69}

Based on infrastructure reuse, expressive power gained, and implementation complexity:
\subsection{Tier 1: Low-Hanging Fruit (High Reuse, Moderate Effort)}
\label{sec:org8fe1adf}

\begin{enumerate}
\item \textbf{Abductive LP} --- Almost free: ATMS assumptions as abducibles,
\texttt{atms-minimal-diagnoses} as explanation engine. Needs only surface syntax.

\item \textbf{Epistemic LP} --- ATMS worldviews as agent knowledge states. Surface syntax +
thin dispatch layer over existing \texttt{atms-solve-all}.

\item \textbf{ASP Integration} --- ATMS \texttt{amb} for choice rules, \texttt{nogood} for integrity
constraints. The hardest part is the surface syntax for aggregates.
\end{enumerate}
